In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/298.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                       3
0       NaN  NaN  NaN  Melton (NP)  1,605,179
1       NaN  NaN  NaN                  100.0%
2    County   PR   TP                     NaN
3   APPLING   19   19                    2809
4  ATKINSON    6    6                    1025

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3
3   APPLING  19  19  2809
4  ATKINSON   6   6  1025
5     BACON   7   7  1514
6     BAKER   7   7   668
7   BALDWIN  16  16  7861

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3
3   APPLING  2809
4  ATKINSON  1025
5     BACON  1514
6     BAKER   668
7   BALDWIN  7861

In [9]:
df.columns = ['county', 'Harold D. Melton']

In [10]:
df.tail(5)

        county Harold D. Melton
157  WHITFIELD            13009
158     WILCOX             1503
159     WILKES             1968
160  WILKINSON             2007
161      WORTH             3887

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county         candidate votes
0   APPLING  Harold D. Melton  2809
1  ATKINSON  Harold D. Melton  1025
2     BACON  Harold D. Melton  1514
3     BAKER  Harold D. Melton   668
4   BALDWIN  Harold D. Melton  7861

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 3 columns):
county       159 non-null object
candidate    159 non-null object
votes        159 non-null int64
dtypes: int64(1), object(2)
memory usage: 3.8+ KB

In [16]:
df['office'] = 'Supreme Court Justice'

In [17]:
df['district'] = ''

In [18]:
df['party'] = 'Non-Partisan'

In [19]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Harold D. Melton  Non-Partisan    1605179
Name: votes, dtype: int64

In [20]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Supreme Court Justice,,Non-Partisan,Harold D. Melton,2809
1,ATKINSON,Supreme Court Justice,,Non-Partisan,Harold D. Melton,1025
2,BACON,Supreme Court Justice,,Non-Partisan,Harold D. Melton,1514
3,BAKER,Supreme Court Justice,,Non-Partisan,Harold D. Melton,668
4,BALDWIN,Supreme Court Justice,,Non-Partisan,Harold D. Melton,7861

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')